---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetVectorSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings)
source: html/02ebf3f0-e9fb-8091-a65d-3fa2a5b6f869.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetVectorSettings Method

Set vector settings object for the style.

## Syntax (C#)
```csharp
public void SetVectorSettings(
	AnalysisDisplayVectorSettings vectorSettings
)
```

## Parameters
- **vectorSettings** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Vector settings were not created with the object.